#1) необходимо разработать функцию, принимающую список строк и строку, и
#выполняющую вставку строки в середину списка (если длина списка 
#нечетная, то вставлять строку перед серединным элементом);
#2) необходимо разработать функцию, принимающую список строк, число и
#строку, и выполняющую вставку строки в указанную позицию, если вставка 
#на указанную позицию невозможна, то вернуть сообщение «paste operation is
#not possible»;
#3) необходимо разработать функцию, принимающую список строк и число, и 
#выполняющую удаление строки по указанной позицию списка, если удаление
#невозможно, то вернуть сообщение «delete operation is not possible».
